def cases(x1, y1, r1, x2, y2, r2):
    distance = (x1 - x2)**2 + (y1 - y2)**2
    plus = (r1 + r2)**2
    minus = (r1 - r2)**2
    if r1 == r2 and distance == 0: return -1
    elif plus == distance or minus == distance: return 1
    elif minus < distance < plus: return 2
    else: return 0

for _ in range(int(input())):
    x1, y1, r1, x2, y2, r2 = map(int,input().split())
    print(cases(x1, y1, r1, x2, y2, r2))

#Description
'''
조규현과 백승환은 터렛에 근무하는 직원이다. 하지만 워낙 존재감이 없어서 인구수는 차지하지 않는다.
이석원은 조규현과 백승환에게 상대편 마린(류재명)의 위치를 계산하라는 명령을 내렸다. 조규현과 백승환은 각각 자신의 터렛 위치에서 현재 적까지의 거리를 계산했다.
조규현의 좌표 (x1, y1)와 백승환의 좌표 (x2, y2)가 주어지고, 조규현이 계산한 류재명과의 거리 r1과 백승환이 계산한 류재명과의 거리 r2가 주어졌을 때,
류재명이 있을 수 있는 좌표의 수를 출력하는 프로그램을 작성하시오.
'''
#Input
'''
첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는 다음과 같이 이루어져 있다.
한 줄에 공백으로 구분 된 여섯 정수 x1, y1, r1, x2, y2, r2가 주어진다.
'''
#Output
'''
각 테스트 케이스마다 류재명이 있을 수 있는 위치의 수를 출력한다. 만약 류재명이 있을 수 있는 위치가 무한대일 경우에는 -1을 출력한다.
'''

#Solution
'''
중심이 각각 (x1, y1), (x2, y2)이고, 반지름이 각각 r1, r2인 두 원의 교점의 개수를 구하는 문제임
두 원의 중심이 같고 반지름이 같으면 교점이 무한히 많아짐
두 반지름의 합이나 차가 두 중심 사이의 거리와 같으면 교점이 1개 생김
두 중심 사이의 거리가 구 반지름의 차보다 크고 합보다 작으면 교점이 2개 생김
나머지 경우에는 교점이 생기지 않음
'''
